MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GU810/mcu.h
extern volatile RPOR2BITS RPOR2bits __attribute__((__sfr__));

#define RPOR3 RPOR3
extern volatile uint16_t RPOR3 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR3BITS {
  union {
    struct {
      uint16_t RP70R:6;
      uint16_t :2;
      uint16_t RP71R:6;
    };
    struct {
      uint16_t RP70R0:1;
      uint16_t RP70R1:1;
      uint16_t RP70R2:1;
      uint16_t RP70R3:1;
      uint16_t RP70R4:1;
      uint16_t RP70R5:1;
      uint16_t :2;
      uint16_t RP71R0:1;
      uint16_t RP71R1:1;
      uint16_t RP71R2:1;
      uint16_t RP71R3:1;
      uint16_t RP71R4:1;
      uint16_t RP71R5:1;
    };
  };
} RPOR3BITS;
extern volatile RPOR3BITS RPOR3bits __attribute__((__sfr__));

#define RPOR4 RPOR4
extern volatile uint16_t RPOR4 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR4BITS {
  union {
    struct {
      uint16_t RP79R:6;
      uint16_t :2;
      uint16_t RP80R:6;
    };
    struct {
      uint16_t RP79R0:1;
      uint16_t RP79R1:1;
      uint16_t RP79R2:1;
      uint16_t RP79R3:1;
      uint16_t RP79R4:1;
      uint16_t RP79R5:1;
      uint16_t :2;
      uint16_t RP80R0:1;
      uint16_t RP80R1:1;
      uint16_t RP80R2:1;
      uint16_t RP80R3:1;
      uint16_t RP80R4:1;
      uint16_t RP80R5:1;
    };
  };
} RPOR4BITS;
extern volatile RPOR4BITS RPOR4bits __attribute__((__sfr__));

#define RPOR5 RPOR5
extern volatile uint16_t RPOR5 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR5BITS {
  union {
    struct {
      uint16_t RP82R:6;
      uint16_t :2;
      uint16_t RP84R:6;
    };
    struct {
      uint16_t RP82R0:1;
      uint16_t RP82R1:1;
      uint16_t RP82R2:1;
      uint16_t RP82R3:1;
      uint16_t RP82R4:1;
      uint16_t RP82R5:1;
      uint16_t :2;
      uint16_t RP84R0:1;
      uint16_t RP84R1:1;
      uint16_t RP84R2:1;
      uint16_t RP84R3:1;
      uint16_t RP84R4:1;
      uint16_t RP84R5:1;
    };
  };
} RPOR5BITS;
extern volatile RPOR5BITS RPOR5bits __attribute__((__sfr__));

#define RPOR6 RPOR6
extern volatile uint16_t RPOR6 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR6BITS {
  union {
    struct {
      uint16_t RP85R:6;
      uint16_t :2;
      uint16_t RP87R:6;
    };
    struct {
      uint16_t RP85R0:1;
      uint16_t RP85R1:1;
      uint16_t RP85R2:1;
      uint16_t RP85R3:1;
      uint16_t RP85R4:1;
      uint16_t RP85R5:1;
      uint16_t :2;
      uint16_t RP87R0:1;
      uint16_t RP87R1:1;
      uint16_t RP87R2:1;
      uint16_t RP87R3:1;
      uint16_t RP87R4:1;
      uint16_t RP87R5:1;
    };
  };
} RPOR6BITS;
extern volatile RPOR6BITS RPOR6bits __attribute__((__sfr__));

#define RPOR7 RPOR7
extern volatile uint16_t RPOR7 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR7BITS {
  union {
    struct {
      uint16_t RP96R:6;
      uint16_t :2;
      uint16_t RP97R:6;
    };
    struct {
      uint16_t RP96R0:1;
      uint16_t RP96R1:1;
      uint16_t RP96R2:1;
      uint16_t RP96R3:1;
      uint16_t RP96R4:1;
      uint16_t RP96R5:1;
      uint16_t :2;
      uint16_t RP97R0:1;
      uint16_t RP97R1:1;
      uint16_t RP97R2:1;
      uint16_t RP97R3:1;
      uint16_t RP97R4:1;
      uint16_t RP97R5:1;
    };
  };
} RPOR7BITS;
extern volatile RPOR7BITS RPOR7bits __attribute__((__sfr__));

#define RPOR8 RPOR8
extern volatile uint16_t RPOR8 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR8BITS {
  union {
    struct {
      uint16_t RP98R:6;
      uint16_t :2;
      uint16_t RP99R:6;
    };
    struct {
      uint16_t RP98R0:1;
      uint16_t RP98R1:1;
      uint16_t RP98R2:1;
      uint16_t RP98R3:1;
      uint16_t RP98R4:1;
      uint16_t RP98R5:1;
      uint16_t :2;
      uint16_t RP99R0:1;
      uint16_t RP99R1:1;
      uint16_t RP99R2:1;
      uint16_t RP99R3:1;
      uint16_t RP99R4:1;
      uint16_t RP99R5:1;
    };
  };
} RPOR8BITS;
extern volatile RPOR8BITS RPOR8bits __attribute__((__sfr__));

#define RPOR9 RPOR9
extern volatile uint16_t RPOR9 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR9BITS {
  union {
    struct {
      uint16_t RP100R:6;
      uint16_t :2;
      uint16_t RP101R:6;
    };
    struct {
      uint16_t RP100R0:1;
      uint16_t RP100R1:1;
      uint16_t RP100R2:1;
      uint16_t RP100R3:1;
      uint16_t RP100R4:1;
      uint16_t RP100R5:1;
      uint16_t :2;
      uint16_t RP101R0:1;
      uint16_t RP101R1:1;
      uint16_t RP101R2:1;
      uint16_t RP101R3:1;
      uint16_t RP101R4:1;
      uint16_t RP101R5:1;
    };
  };
} RPOR9BITS;
extern volatile RPOR9BITS RPOR9bits __attribute__((__sfr__));

#define RPOR11 RPOR11
extern volatile uint16_t RPOR11 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR11BITS {
  union {
    struct {
      uint16_t RP104R:6;
      uint16_t :2;
      uint16_t RP108R:6;
    };
    struct {
      uint16_t RP104R0:1;
      uint16_t RP104R1:1;
      uint16_t RP104R2:1;
      uint16_t RP104R3:1;
      uint16_t RP104R4:1;
      uint16_t RP104R5:1;
      uint16_t :2;
      uint16_t RP108R0:1;
      uint16_t RP108R1:1;
      uint16_t RP108R2:1;
      uint16_t RP108R3:1;
      uint16_t RP108R4:1;
      uint16_t RP108R5:1;
    };
  };
} RPOR11BITS;
extern volatile RPOR11BITS RPOR11bits __attribute__((__sfr__));

#define RPOR12 RPOR12
extern volatile uint16_t RPOR12 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR12BITS {
  union {
    struct {
      uint16_t RP109R:6;
      uint16_t :2;
      uint16_t RP112R:6;
    };
    struct {
      uint16_t RP109R0:1;
      uint16_t RP109R1:1;
      uint16_t RP109R2:1;
      uint16_t RP109R3:1;
      uint16_t RP109R4:1;
      uint16_t RP109R5:1;
      uint16_t :2;
      uint16_t RP112R0:1;
      uint16_t RP112R1:1;
      uint16_t RP112R2:1;
      uint16_t RP112R3:1;
      uint16_t RP112R4:1;
      uint16_t RP112R5:1;
    };
  };
} RPOR12BITS;
extern volatile RPOR12BITS RPOR12bits __attribute__((__sfr__));

#define RPOR13 RPOR13
extern volatile uint16_t RPOR13 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR13BITS {
  union {
    struct {
      uint16_t RP113R:6;
      uint16_t :2;
      uint16_t RP118R:6;
    };
    struct {
      uint16_t RP113R0:1;
      uint16_t RP113R1:1;
      uint16_t RP113R2:1;
      uint16_t RP113R3:1;
      uint16_t RP113R4:1;
      uint16_t RP113R5:1;
      uint16_t :2;
      uint16_t RP118R0:1;
      uint16_t RP118R1:1;
      uint16_t RP118R2:1;
      uint16_t RP118R3:1;
      uint16_t RP118R4:1;
      uint16_t RP118R5:1;
    };
  };
} RPOR13BITS;
extern volatile RPOR13BITS RPOR13bits __attribute__((__sfr__));

#define RPOR14 RPOR14
extern volatile uint16_t RPOR14 __attribute__((__sfr__));
__extension__ typedef struct tagRPOR14BITS {
  union {
    struct {
      uint16_t RP120R:6;
      uint16_t :2;
      uint16_t RP125R:6;
    };
    struct {
      uint16_t RP120R0:1;
      uint16_t RP120R1:1;
      uint16_t RP120R2:1;
      uint16_t RP120R3:1;
      uint16_t RP120R4:1;
      uint16_t RP120R5:1;
      uint16_t :2;
      uint16_t RP125R0:1;
      uint16_t RP125R1:1;
      uint16_t RP125R2:1;
      uint16_t RP125R3:1;
      uint16_t RP125R4:1;
      uint16_t RP125R5:1;
    };
  };
} RPOR14BITS;
