MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GU810/mcu.h
#define IPC30 IPC30
extern volatile uint16_t IPC30 __attribute__((__sfr__));
__extension__ typedef struct tagIPC30BITS {
  union {
    struct {
      uint16_t DMA10IP:3;
      uint16_t :1;
      uint16_t DMA11IP:3;
      uint16_t :1;
      uint16_t SPI4EIP:3;
      uint16_t :1;
      uint16_t SPI4IP:3;
    };
    struct {
      uint16_t DMA10IP0:1;
      uint16_t DMA10IP1:1;
      uint16_t DMA10IP2:1;
      uint16_t :1;
      uint16_t DMA11IP0:1;
      uint16_t DMA11IP1:1;
      uint16_t DMA11IP2:1;
      uint16_t :1;
      uint16_t SPI4EIP0:1;
      uint16_t SPI4EIP1:1;
      uint16_t SPI4EIP2:1;
      uint16_t :1;
      uint16_t SPI4IP0:1;
      uint16_t SPI4IP1:1;
      uint16_t SPI4IP2:1;
    };
  };
} IPC30BITS;
extern volatile IPC30BITS IPC30bits __attribute__((__sfr__));

#define IPC31 IPC31
extern volatile uint16_t IPC31 __attribute__((__sfr__));
__extension__ typedef struct tagIPC31BITS {
  union {
    struct {
      uint16_t OC10IP:3;
      uint16_t :1;
      uint16_t IC10IP:3;
      uint16_t :1;
      uint16_t OC11IP:3;
      uint16_t :1;
      uint16_t IC11IP:3;
    };
    struct {
      uint16_t OC10IP0:1;
      uint16_t OC10IP1:1;
      uint16_t OC10IP2:1;
      uint16_t :1;
      uint16_t IC10IP0:1;
      uint16_t IC10IP1:1;
      uint16_t IC10IP2:1;
      uint16_t :1;
      uint16_t OC11IP0:1;
      uint16_t OC11IP1:1;
      uint16_t OC11IP2:1;
      uint16_t :1;
      uint16_t IC11IP0:1;
      uint16_t IC11IP1:1;
      uint16_t IC11IP2:1;
    };
  };
} IPC31BITS;
extern volatile IPC31BITS IPC31bits __attribute__((__sfr__));

#define IPC32 IPC32
extern volatile uint16_t IPC32 __attribute__((__sfr__));
__extension__ typedef struct tagIPC32BITS {
  union {
    struct {
      uint16_t OC12IP:3;
      uint16_t :1;
      uint16_t IC12IP:3;
      uint16_t :1;
      uint16_t DMA12IP:3;
      uint16_t :1;
      uint16_t DMA13IP:3;
    };
    struct {
      uint16_t OC12IP0:1;
      uint16_t OC12IP1:1;
      uint16_t OC12IP2:1;
      uint16_t :1;
      uint16_t IC12IP0:1;
      uint16_t IC12IP1:1;
      uint16_t IC12IP2:1;
      uint16_t :1;
      uint16_t DMA12IP0:1;
      uint16_t DMA12IP1:1;
      uint16_t DMA12IP2:1;
      uint16_t :1;
      uint16_t DMA13IP0:1;
      uint16_t DMA13IP1:1;
      uint16_t DMA13IP2:1;
    };
  };
} IPC32BITS;
extern volatile IPC32BITS IPC32bits __attribute__((__sfr__));

#define IPC33 IPC33
extern volatile uint16_t IPC33 __attribute__((__sfr__));
__extension__ typedef struct tagIPC33BITS {
  union {
    struct {
      uint16_t DMA14IP:3;
      uint16_t :5;
      uint16_t OC13IP:3;
      uint16_t :1;
      uint16_t IC13IP:3;
    };
    struct {
      uint16_t DMA14IP0:1;
      uint16_t DMA14IP1:1;
      uint16_t DMA14IP2:1;
      uint16_t :5;
      uint16_t OC13IP0:1;
      uint16_t OC13IP1:1;
      uint16_t OC13IP2:1;
      uint16_t :1;
      uint16_t IC13IP0:1;
      uint16_t IC13IP1:1;
      uint16_t IC13IP2:1;
    };
  };
} IPC33BITS;
extern volatile IPC33BITS IPC33bits __attribute__((__sfr__));

#define IPC34 IPC34
extern volatile uint16_t IPC34 __attribute__((__sfr__));
__extension__ typedef struct tagIPC34BITS {
  union {
    struct {
      uint16_t OC14IP:3;
      uint16_t :1;
      uint16_t IC14IP:3;
      uint16_t :1;
      uint16_t OC15IP:3;
      uint16_t :1;
      uint16_t IC15IP:3;
    };
    struct {
      uint16_t OC14IP0:1;
      uint16_t OC14IP1:1;
      uint16_t OC14IP2:1;
      uint16_t :1;
      uint16_t IC14IP0:1;
      uint16_t IC14IP1:1;
      uint16_t IC14IP2:1;
      uint16_t :1;
      uint16_t OC15IP0:1;
      uint16_t OC15IP1:1;
      uint16_t OC15IP2:1;
      uint16_t :1;
      uint16_t IC15IP0:1;
      uint16_t IC15IP1:1;
      uint16_t IC15IP2:1;
    };
  };
} IPC34BITS;
extern volatile IPC34BITS IPC34bits __attribute__((__sfr__));

#define IPC35 IPC35
extern volatile uint16_t IPC35 __attribute__((__sfr__));
__extension__ typedef struct tagIPC35BITS {
  union {
    struct {
      uint16_t OC16IP:3;
      uint16_t :1;
      uint16_t IC16IP:3;
      uint16_t :1;
      uint16_t ICDIP:3;
    };
    struct {
      uint16_t OC16IP0:1;
      uint16_t OC16IP1:1;
      uint16_t OC16IP2:1;
      uint16_t :1;
      uint16_t IC16IP0:1;
      uint16_t IC16IP1:1;
      uint16_t IC16IP2:1;
      uint16_t :1;
      uint16_t ICDIP0:1;
      uint16_t ICDIP1:1;
      uint16_t ICDIP2:1;
    };
  };
} IPC35BITS;
extern volatile IPC35BITS IPC35bits __attribute__((__sfr__));

#define INTCON1 INTCON1
extern volatile uint16_t INTCON1 __attribute__((__sfr__));
typedef struct tagINTCON1BITS {
  uint16_t :1;
  uint16_t OSCFAIL:1;
  uint16_t STKERR:1;
  uint16_t ADDRERR:1;
  uint16_t MATHERR:1;
  uint16_t DMACERR:1;
  uint16_t DIV0ERR:1;
  uint16_t SFTACERR:1;
  uint16_t COVTE:1;
  uint16_t OVBTE:1;
  uint16_t OVATE:1;
  uint16_t COVBERR:1;
  uint16_t COVAERR:1;
  uint16_t OVBERR:1;
  uint16_t OVAERR:1;
  uint16_t NSTDIS:1;
} INTCON1BITS;
extern volatile INTCON1BITS INTCON1bits __attribute__((__sfr__));

#define INTCON2 INTCON2
extern volatile uint16_t INTCON2 __attribute__((__sfr__));
typedef struct tagINTCON2BITS {
  uint16_t INT0EP:1;
  uint16_t INT1EP:1;
  uint16_t INT2EP:1;
  uint16_t INT3EP:1;
  uint16_t INT4EP:1;
  uint16_t :8;
  uint16_t SWTRAP:1;
  uint16_t DISI:1;
  uint16_t GIE:1;
} INTCON2BITS;
extern volatile INTCON2BITS INTCON2bits __attribute__((__sfr__));

#define INTCON3 INTCON3
extern volatile uint16_t INTCON3 __attribute__((__sfr__));
typedef struct tagINTCON3BITS {
  uint16_t :4;
  uint16_t DOOVR:1;
  uint16_t DAE:1;
  uint16_t UAE:1;
} INTCON3BITS;
extern volatile INTCON3BITS INTCON3bits __attribute__((__sfr__));

#define INTCON4 INTCON4
extern volatile uint16_t INTCON4 __attribute__((__sfr__));
typedef struct tagINTCON4BITS {
  uint16_t SGHT:1;
} INTCON4BITS;
extern volatile INTCON4BITS INTCON4bits __attribute__((__sfr__));

#define INTTREG INTTREG
extern volatile uint16_t INTTREG __attribute__((__sfr__));
__extension__ typedef struct tagINTTREGBITS {
  union {
    struct {
      uint16_t VECNUM:8;
      uint16_t ILR:4;
    };
    struct {
      uint16_t VECNUM0:1;
      uint16_t VECNUM1:1;
      uint16_t VECNUM2:1;
      uint16_t VECNUM3:1;
      uint16_t VECNUM4:1;
      uint16_t VECNUM5:1;
      uint16_t VECNUM6:1;
      uint16_t VECNUM7:1;
      uint16_t ILR0:1;
      uint16_t ILR1:1;
      uint16_t ILR2:1;
      uint16_t ILR3:1;
    };
  };
} INTTREGBITS;
extern volatile INTTREGBITS INTTREGbits __attribute__((__sfr__));

