MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GU810/mcu.h
#define OC12RS OC12RS
extern volatile uint16_t OC12RS __attribute__((__sfr__));
#define OC12R OC12R
extern volatile uint16_t OC12R __attribute__((__sfr__));
#define OC12TMR OC12TMR
extern volatile uint16_t OC12TMR __attribute__((__sfr__));
#define OC13CON1 OC13CON1
extern volatile uint16_t OC13CON1 __attribute__((__sfr__));
__extension__ typedef struct tagOC13CON1BITS {
  union {
    struct {
      uint16_t OCM:3;
      uint16_t TRIGMODE:1;
      uint16_t OCFLTA:1;
      uint16_t OCFLTB:1;
      uint16_t OCFLTC:1;
      uint16_t ENFLTA:1;
      uint16_t ENFLTB:1;
      uint16_t ENFLTC:1;
      uint16_t OCTSEL:3;
      uint16_t OCSIDL:1;
    };
    struct {
      uint16_t OCM0:1;
      uint16_t OCM1:1;
      uint16_t OCM2:1;
      uint16_t :1;
      uint16_t OCFLT:3;
      uint16_t ENFLT:3;
      uint16_t OCTSEL0:1;
      uint16_t OCTSEL1:1;
      uint16_t OCTSEL2:1;
    };
    struct {
      uint16_t :4;
      uint16_t OCFLT0:1;
      uint16_t OCFLT1:1;
      uint16_t OCFLT2:1;
      uint16_t ENFLT0:1;
      uint16_t ENFLT1:1;
      uint16_t ENFLT2:1;
    };
  };
} OC13CON1BITS;
extern volatile OC13CON1BITS OC13CON1bits __attribute__((__sfr__));

#define OC13CON2 OC13CON2
extern volatile uint16_t OC13CON2 __attribute__((__sfr__));
__extension__ typedef struct tagOC13CON2BITS {
  union {
    struct {
      uint16_t SYNCSEL:5;
      uint16_t OCTRIS:1;
      uint16_t TRIGSTAT:1;
      uint16_t OCTRIG:1;
      uint16_t OC32:1;
      uint16_t :3;
      uint16_t OCINV:1;
      uint16_t FLTTRIEN:1;
      uint16_t FLTOUT:1;
      uint16_t FLTMD:1;
    };
    struct {
      uint16_t SYNCSEL0:1;
      uint16_t SYNCSEL1:1;
      uint16_t SYNCSEL2:1;
      uint16_t SYNCSEL3:1;
      uint16_t SYNCSEL4:1;
      uint16_t :9;
      uint16_t FLTMODE:1;
    };
  };
} OC13CON2BITS;
extern volatile OC13CON2BITS OC13CON2bits __attribute__((__sfr__));

#define OC13RS OC13RS
extern volatile uint16_t OC13RS __attribute__((__sfr__));
#define OC13R OC13R
extern volatile uint16_t OC13R __attribute__((__sfr__));
#define OC13TMR OC13TMR
extern volatile uint16_t OC13TMR __attribute__((__sfr__));
#define OC14CON1 OC14CON1
extern volatile uint16_t OC14CON1 __attribute__((__sfr__));
__extension__ typedef struct tagOC14CON1BITS {
  union {
    struct {
      uint16_t OCM:3;
      uint16_t TRIGMODE:1;
      uint16_t OCFLTA:1;
      uint16_t OCFLTB:1;
      uint16_t OCFLTC:1;
      uint16_t ENFLTA:1;
      uint16_t ENFLTB:1;
      uint16_t ENFLTC:1;
      uint16_t OCTSEL:3;
      uint16_t OCSIDL:1;
    };
    struct {
      uint16_t OCM0:1;
      uint16_t OCM1:1;
      uint16_t OCM2:1;
      uint16_t :1;
      uint16_t OCFLT:3;
      uint16_t ENFLT:3;
      uint16_t OCTSEL0:1;
      uint16_t OCTSEL1:1;
      uint16_t OCTSEL2:1;
    };
    struct {
      uint16_t :4;
      uint16_t OCFLT0:1;
      uint16_t OCFLT1:1;
      uint16_t OCFLT2:1;
      uint16_t ENFLT0:1;
      uint16_t ENFLT1:1;
      uint16_t ENFLT2:1;
    };
  };
} OC14CON1BITS;
extern volatile OC14CON1BITS OC14CON1bits __attribute__((__sfr__));

#define OC14CON2 OC14CON2
extern volatile uint16_t OC14CON2 __attribute__((__sfr__));
__extension__ typedef struct tagOC14CON2BITS {
  union {
    struct {
      uint16_t SYNCSEL:5;
      uint16_t OCTRIS:1;
      uint16_t TRIGSTAT:1;
      uint16_t OCTRIG:1;
      uint16_t OC32:1;
      uint16_t :3;
      uint16_t OCINV:1;
      uint16_t FLTTRIEN:1;
      uint16_t FLTOUT:1;
      uint16_t FLTMD:1;
    };
    struct {
      uint16_t SYNCSEL0:1;
      uint16_t SYNCSEL1:1;
      uint16_t SYNCSEL2:1;
      uint16_t SYNCSEL3:1;
      uint16_t SYNCSEL4:1;
      uint16_t :9;
      uint16_t FLTMODE:1;
    };
  };
} OC14CON2BITS;
extern volatile OC14CON2BITS OC14CON2bits __attribute__((__sfr__));

#define OC14RS OC14RS
extern volatile uint16_t OC14RS __attribute__((__sfr__));
#define OC14R OC14R
extern volatile uint16_t OC14R __attribute__((__sfr__));
#define OC14TMR OC14TMR
extern volatile uint16_t OC14TMR __attribute__((__sfr__));
#define OC15CON1 OC15CON1
extern volatile uint16_t OC15CON1 __attribute__((__sfr__));
__extension__ typedef struct tagOC15CON1BITS {
  union {
    struct {
      uint16_t OCM:3;
      uint16_t TRIGMODE:1;
      uint16_t OCFLTA:1;
      uint16_t OCFLTB:1;
      uint16_t OCFLTC:1;
      uint16_t ENFLTA:1;
      uint16_t ENFLTB:1;
      uint16_t ENFLTC:1;
      uint16_t OCTSEL:3;
      uint16_t OCSIDL:1;
    };
    struct {
      uint16_t OCM0:1;
      uint16_t OCM1:1;
      uint16_t OCM2:1;
      uint16_t :1;
      uint16_t OCFLT:3;
      uint16_t ENFLT:3;
      uint16_t OCTSEL0:1;
      uint16_t OCTSEL1:1;
      uint16_t OCTSEL2:1;
    };
    struct {
      uint16_t :4;
      uint16_t OCFLT0:1;
      uint16_t OCFLT1:1;
      uint16_t OCFLT2:1;
      uint16_t ENFLT0:1;
      uint16_t ENFLT1:1;
      uint16_t ENFLT2:1;
    };
  };
} OC15CON1BITS;
extern volatile OC15CON1BITS OC15CON1bits __attribute__((__sfr__));

#define OC15CON2 OC15CON2
extern volatile uint16_t OC15CON2 __attribute__((__sfr__));
__extension__ typedef struct tagOC15CON2BITS {
  union {
    struct {
      uint16_t SYNCSEL:5;
      uint16_t OCTRIS:1;
      uint16_t TRIGSTAT:1;
      uint16_t OCTRIG:1;
      uint16_t OC32:1;
      uint16_t :3;
      uint16_t OCINV:1;
      uint16_t FLTTRIEN:1;
      uint16_t FLTOUT:1;
      uint16_t FLTMD:1;
    };
    struct {
      uint16_t SYNCSEL0:1;
      uint16_t SYNCSEL1:1;
      uint16_t SYNCSEL2:1;
      uint16_t SYNCSEL3:1;
      uint16_t SYNCSEL4:1;
      uint16_t :9;
      uint16_t FLTMODE:1;
    };
  };
} OC15CON2BITS;
extern volatile OC15CON2BITS OC15CON2bits __attribute__((__sfr__));

#define OC15RS OC15RS
extern volatile uint16_t OC15RS __attribute__((__sfr__));
#define OC15R OC15R
extern volatile uint16_t OC15R __attribute__((__sfr__));
#define OC15TMR OC15TMR
extern volatile uint16_t OC15TMR __attribute__((__sfr__));
#define OC16CON1 OC16CON1
extern volatile uint16_t OC16CON1 __attribute__((__sfr__));
__extension__ typedef struct tagOC16CON1BITS {
  union {
    struct {
      uint16_t OCM:3;
      uint16_t TRIGMODE:1;
      uint16_t OCFLTA:1;
      uint16_t OCFLTB:1;
      uint16_t OCFLTC:1;
      uint16_t ENFLTA:1;
      uint16_t ENFLTB:1;
      uint16_t ENFLTC:1;
      uint16_t OCTSEL:3;
      uint16_t OCSIDL:1;
    };
    struct {
      uint16_t OCM0:1;
      uint16_t OCM1:1;
      uint16_t OCM2:1;
      uint16_t :1;
      uint16_t OCFLT:3;
      uint16_t ENFLT:3;
      uint16_t OCTSEL0:1;
      uint16_t OCTSEL1:1;
      uint16_t OCTSEL2:1;
    };
    struct {
      uint16_t :4;
      uint16_t OCFLT0:1;
      uint16_t OCFLT1:1;
      uint16_t OCFLT2:1;
      uint16_t ENFLT0:1;
      uint16_t ENFLT1:1;
      uint16_t ENFLT2:1;
    };
  };
} OC16CON1BITS;
