MikroElektronika/core_packages/dsPIC/XC16/def/PIC24EP512GU810/mcu.h
#define _RPINR36_IC15R5_POSITION                 0x00000005
#define _RPINR36_IC15R5_MASK                     0x00000020
#define _RPINR36_IC15R5_LENGTH                   0x00000001

#define _RPINR36_IC15R6_POSITION                 0x00000006
#define _RPINR36_IC15R6_MASK                     0x00000040
#define _RPINR36_IC15R6_LENGTH                   0x00000001

#define _RPINR36_IC16R0_POSITION                 0x00000008
#define _RPINR36_IC16R0_MASK                     0x00000100
#define _RPINR36_IC16R0_LENGTH                   0x00000001

#define _RPINR36_IC16R1_POSITION                 0x00000009
#define _RPINR36_IC16R1_MASK                     0x00000200
#define _RPINR36_IC16R1_LENGTH                   0x00000001

#define _RPINR36_IC16R2_POSITION                 0x0000000A
#define _RPINR36_IC16R2_MASK                     0x00000400
#define _RPINR36_IC16R2_LENGTH                   0x00000001

#define _RPINR36_IC16R3_POSITION                 0x0000000B
#define _RPINR36_IC16R3_MASK                     0x00000800
#define _RPINR36_IC16R3_LENGTH                   0x00000001

#define _RPINR36_IC16R4_POSITION                 0x0000000C
#define _RPINR36_IC16R4_MASK                     0x00001000
#define _RPINR36_IC16R4_LENGTH                   0x00000001

#define _RPINR36_IC16R5_POSITION                 0x0000000D
#define _RPINR36_IC16R5_MASK                     0x00002000
#define _RPINR36_IC16R5_LENGTH                   0x00000001

#define _RPINR36_IC16R6_POSITION                 0x0000000E
#define _RPINR36_IC16R6_MASK                     0x00004000
#define _RPINR36_IC16R6_LENGTH                   0x00000001

#define _RPINR37_OCFCR_POSITION                  0x00000000
#define _RPINR37_OCFCR_MASK                      0x0000007F
#define _RPINR37_OCFCR_LENGTH                    0x00000007

#define _RPINR37_FLT5R_POSITION                  0x00000008
#define _RPINR37_FLT5R_MASK                      0x00007F00
#define _RPINR37_FLT5R_LENGTH                    0x00000007

#define _RPINR37_OCFCR0_POSITION                 0x00000000
#define _RPINR37_OCFCR0_MASK                     0x00000001
#define _RPINR37_OCFCR0_LENGTH                   0x00000001

#define _RPINR37_OCFCR1_POSITION                 0x00000001
#define _RPINR37_OCFCR1_MASK                     0x00000002
#define _RPINR37_OCFCR1_LENGTH                   0x00000001

#define _RPINR37_OCFCR2_POSITION                 0x00000002
#define _RPINR37_OCFCR2_MASK                     0x00000004
#define _RPINR37_OCFCR2_LENGTH                   0x00000001

#define _RPINR37_OCFCR3_POSITION                 0x00000003
#define _RPINR37_OCFCR3_MASK                     0x00000008
#define _RPINR37_OCFCR3_LENGTH                   0x00000001

#define _RPINR37_OCFCR4_POSITION                 0x00000004
#define _RPINR37_OCFCR4_MASK                     0x00000010
#define _RPINR37_OCFCR4_LENGTH                   0x00000001

#define _RPINR37_OCFCR5_POSITION                 0x00000005
#define _RPINR37_OCFCR5_MASK                     0x00000020
#define _RPINR37_OCFCR5_LENGTH                   0x00000001

#define _RPINR37_OCFCR6_POSITION                 0x00000006
#define _RPINR37_OCFCR6_MASK                     0x00000040
#define _RPINR37_OCFCR6_LENGTH                   0x00000001

#define _RPINR37_FLT5R0_POSITION                 0x00000008
#define _RPINR37_FLT5R0_MASK                     0x00000100
#define _RPINR37_FLT5R0_LENGTH                   0x00000001

#define _RPINR37_FLT5R1_POSITION                 0x00000009
#define _RPINR37_FLT5R1_MASK                     0x00000200
#define _RPINR37_FLT5R1_LENGTH                   0x00000001

#define _RPINR37_FLT5R2_POSITION                 0x0000000A
#define _RPINR37_FLT5R2_MASK                     0x00000400
#define _RPINR37_FLT5R2_LENGTH                   0x00000001

#define _RPINR37_FLT5R3_POSITION                 0x0000000B
#define _RPINR37_FLT5R3_MASK                     0x00000800
#define _RPINR37_FLT5R3_LENGTH                   0x00000001

#define _RPINR37_FLT5R4_POSITION                 0x0000000C
#define _RPINR37_FLT5R4_MASK                     0x00001000
#define _RPINR37_FLT5R4_LENGTH                   0x00000001

#define _RPINR37_FLT5R5_POSITION                 0x0000000D
#define _RPINR37_FLT5R5_MASK                     0x00002000
#define _RPINR37_FLT5R5_LENGTH                   0x00000001

#define _RPINR37_FLT5R6_POSITION                 0x0000000E
#define _RPINR37_FLT5R6_MASK                     0x00004000
#define _RPINR37_FLT5R6_LENGTH                   0x00000001

#define _RPINR38_FLT6R_POSITION                  0x00000000
#define _RPINR38_FLT6R_MASK                      0x0000007F
#define _RPINR38_FLT6R_LENGTH                    0x00000007

#define _RPINR38_FLT7R_POSITION                  0x00000008
#define _RPINR38_FLT7R_MASK                      0x00007F00
#define _RPINR38_FLT7R_LENGTH                    0x00000007

#define _RPINR38_FLT6R0_POSITION                 0x00000000
#define _RPINR38_FLT6R0_MASK                     0x00000001
#define _RPINR38_FLT6R0_LENGTH                   0x00000001

#define _RPINR38_FLT6R1_POSITION                 0x00000001
#define _RPINR38_FLT6R1_MASK                     0x00000002
#define _RPINR38_FLT6R1_LENGTH                   0x00000001

#define _RPINR38_FLT6R2_POSITION                 0x00000002
#define _RPINR38_FLT6R2_MASK                     0x00000004
#define _RPINR38_FLT6R2_LENGTH                   0x00000001

#define _RPINR38_FLT6R3_POSITION                 0x00000003
#define _RPINR38_FLT6R3_MASK                     0x00000008
#define _RPINR38_FLT6R3_LENGTH                   0x00000001

#define _RPINR38_FLT6R4_POSITION                 0x00000004
#define _RPINR38_FLT6R4_MASK                     0x00000010
#define _RPINR38_FLT6R4_LENGTH                   0x00000001

#define _RPINR38_FLT6R5_POSITION                 0x00000005
#define _RPINR38_FLT6R5_MASK                     0x00000020
#define _RPINR38_FLT6R5_LENGTH                   0x00000001

#define _RPINR38_FLT6R6_POSITION                 0x00000006
#define _RPINR38_FLT6R6_MASK                     0x00000040
#define _RPINR38_FLT6R6_LENGTH                   0x00000001

#define _RPINR38_FLT7R0_POSITION                 0x00000008
#define _RPINR38_FLT7R0_MASK                     0x00000100
#define _RPINR38_FLT7R0_LENGTH                   0x00000001

#define _RPINR38_FLT7R1_POSITION                 0x00000009
#define _RPINR38_FLT7R1_MASK                     0x00000200
#define _RPINR38_FLT7R1_LENGTH                   0x00000001

#define _RPINR38_FLT7R2_POSITION                 0x0000000A
#define _RPINR38_FLT7R2_MASK                     0x00000400
#define _RPINR38_FLT7R2_LENGTH                   0x00000001

